Autodesk.Revit.DB.LinkLoadContent.SetLinkDataPath(Autodesk.Revit.DB.ModelPath)
Sets the Link data path owned by this LinkLoadContent object.
Remarks:
This path must be a location accessible to Revit. Revit will
attempt to load the link from this location.
linkPath:
The Links data path set for this LinkLoadContent object.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2015